import solution from './exam038-138477';

describe('명예의 전당 (1)', () => {
  test('기본 테스트 케이스 검증', () => {
    expect(solution(3, [10, 100, 20, 150, 1, 100, 200])) //
      .toEqual([10, 10, 10, 20, 20, 100, 100]);
    expect(solution(4, [0, 300, 40, 300, 20, 70, 150, 50, 500, 1000])) //
      .toEqual([0, 0, 0, 0, 20, 40, 70, 70, 150, 300]);
  });

  test('추가 테스트 케이스 검증', () => {
    expect(solution(3, [100, 30, 40, 150, 300, 200, 200])) //
      .toEqual([100, 30, 30, 40, 100, 150, 200]);
  });
});
